{"References": ["1554\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\n13%\n7% 11%\n0%\n18%\n0%\n29%\n10%\n0%\nRelative frequency\nFig. 20   Usage evolution for clustering\n13%\n0%\n11%\n13%\n9%\n14%\n0%\n8%\n11%\nRelative frequency\nFig. 21   Usage evolution for regression\n0%\n0%\n0%\n13%\n0%\n7%\n0%\n14%\n11%\nRelative frequency\nFig. 22   Usage evolution for ensemble learning\n16\n3\n3\n2\n1\n1\n1\n1\n1\n5\n2\n1\n1\n1\nMulti-layer perceptron\nSelf-Organizing Maps\nLSTM\nDeep Belief Networks\nStacked Denoising Autoencoders\nCNN\nArtificial Neural Agents\nAutoencoder\nELM\nRandom Forests\nGradient boosting\nStacking\nBagging\nMachine learner fusion-regression\nNN\nEnsemble\nLearning\nNumber of uses\nFig. 23   Detail on the techniques of the NN and ensemble learning \nfamilies\nAppendix III: Detail on NN and Ensemble learning \ntechniques\nSee Fig. 23.\nReferences\nAissani, N., Bekrar, A., Trentesaux, D., & Beldjilali, B. (2012). \nDynamic scheduling for multi-site companies: A decisional \napproach based on reinforcement multi-agent learning. Journal \nof Intelligent Manufacturing, 23(6), 2513–2529.\nAltaf, M. S., Bouferguene, A., Liu, H., Al-Hussein, M., & Yu, H. \n(2018). Integrated production planning and control system for \na panelized home prefabrication facility using simulation and \nRFID. Automation in Construction, 85, 369–383.\nBergmann, S., Feldkamp, N., & Strassburger, S. (2016). Approxima-\ntion of dispatching rules for manufacturing simulation using \ndata mining methods. In 2015 winter simulation conference (pp. \n2329–2340). Huntington Beach, USA.\nBi, J., & Zhang, C. (2018). An empirical comparison on state-of-the-art \nmulti-class imbalance learning algorithms and a new diversi-\nfied ensemble learning scheme. Knowledge-Based Systems, 158, \n81–93.\n", []], "Acknowledgements ": ["1551\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\nThis would avoid investment in sensors and resources \nand architecture that would not be exploited. Concern-\ning the retraining policy, a review in the context of PPC \nreporting common practices, advantages and pitfalls \nseems to be missing in the scientific literature.\n2.\t Improve the integration between the PPC, logistics, and \ndesign: it was stated that the PPC benefits from different \nuse cases. However, recent literature seems to overlook \nlogistics as well as product and process design applica-\ntions coupled with the PPC. To tackle this challenge, \nit is necessary enable data availability, continuity and \nsharing over the design, logistics, and production depart-\nments. This could be achieved through interoperability \nas well as communication of intra-organizational sys-\ntems such as the PLM, ERP, and MES. Even if projects \nthat are meant to couple such systems are costly, they \nare necessary to ensure data availability and quality. One \nway to achieve this is the use of data lakes, which have \nbeen recognized as suitable to handle big data reposito-\nries of a structured and unstructured nature (Llave 2018; \nLo Giudice et al. 2019). For instance, Llave (2018) con-\ncluded, through expert interviews, that one of the key \npurposes of data lakes is to serve as experimentation \nplatforms for data scientists.\n3.\t Set human interaction and environmental aspect as pri-\norities to ensure the development of ethical manufactur-\ning in I4.0: exploring the interaction of humans with \nthe proposed ML-PPC models is paramount to build-\ning inclusive technologies at the service of society. To \nachieve this, the short- and long-term impact of ML-\nPPC systems on employees’ working conditions must \nbe assessed. If the system degrades them, it must be \nredesigned. Concerning the second aspect, seeking a \nreduction in the environmental impact of manufactur-\ning through ML could provide important developments. \nThis can be addressed from a purely PPC approach by \noptimizing, for instance, the scheduling of disassembly \nprocesses or by improving the prediction of production \ntimes to avoid energy waste. Other approaches could \nbe the optimization of the supply chain. Even though \nthe supply chain was not covered in this review, it is an \nappropriate domain for researchers to implement ML \napplications. For instance, by considering environmental \ncriteria when choosing suppliers, as in (Hosseini and \nBarker 2016).\nSome of the research gaps indicated in this review could \nmotivate future work. Future work will be focused on the \nfollowing aspects:\n1.\t The proposed activities will be reviewed to determine \nan order between them, creating a procedure: this would \nhelp shift from a linear to a circular workflow when \nimplementing ML-PPC models.\n2.\t The most suitable techniques and tools will be linked to \neach of the activities with sectorial information: linking \ntechniques, tools, and activities is the key to creating \ngood practices that could be helpful to new practitioners, \nboth in research and industry. Furthermore, according to \nKusiak (2017, 2019), there are profound differences in \nthe volume of data generation and usage across different \nindustries. Therefore, future work will aim to identify \ntrends categorized by sectorial information.\n3.\t The current state of data availability solutions and work-\narounds will be explored: as data availability was found \nto be a main issue, a review of techniques to tackle the \nclass-imbalance problem and the use of transfer learning \nin the context of PPC will be performed. Additionally, \nthe utilization of data lakes for ML-PPC will also be \nexplored.\n4.\t Future research avenues will be proposed through an \nNLP analysis: NLP may enable the discovery of non-\ntrivial trends present in the corpus of the 93 sampled \narticles. This will complement the results of the system-\natic literature review.\nAcknowledgements  This work was financially supported by a part-\nnership between the company iFAKT France SAS and the ANRT \n(Association Nationale de la Recherche et de la Technologie) under \nthe Grant 2018/1266. Furthermore, the authors thank the Editor-in-\nchief and three anonymous referees who helped improve the quality of \nthis paper through their comments and suggestions.\nCompliance with ethical standards \nConflict of interest  The authors declare that they have no conflict of \ninterest.\nAppendix\nAppendix I: Detail on the search strategy \nfor the bibliometric analysis\nSee Figs. 14, 15 and 16.\n", [330, 331, 350]], "Conclusion and further research perspectives": ["1549\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\na detailed view of the matrix indicating the scientific articles \nwith their respective learning types found in each domain.\nFigure 12 shows that among the 56 possible domains, \n18 (32%) were not addressed at all. Furthermore, 24 (43%) \ndomains lie in the range of 1 to 3 papers. This means that \nnearly half of the domains are in an exploration phase. These \ntwo remarks lead to conclude that ML-PPC in the I4.0 is still \nan active research topic with strong perspectives.\nFrom Fig. 13, it can be said that there is a strong trend of \nusing multiple synergies between learning types across all \nof the different use cases. However, there are no applications \nof RL in Time Estimation and in Smart Design of Products \nand Processes. The reason for this may be that these use \ncases have strong strategic impacts. Therefore, current ML \nimplementations in such applications aim to support deci-\nsions rather than automating them such as with agent-based \nsystems driven by RL.\nThere are two use cases achieving a high maturity: Smart \nPlanning and Scheduling and Process Control and Moni-\ntoring. They both cover all but one of the characteristics \nof I4.0. In the case of Smart Planning and Scheduling, it \nfails to address the Self-Execution of Resources and Pro-\ncesses, which suggests that there are research perspectives \nin coupling the production planning and scheduling with \nautonomous physical resources. For the Process Control \nand Monitoring, there is a lack of applications satisfying \nthe Customer-Centric Product Development, which would \nbe an automatic optimization of physical resources from the \nanalysis of customer-related variables.\nKnowledge Discovery and Generation is the only char-\nacteristic addressed by all the use cases, which denotes an \nintense interest in knowledge creation from data. Further-\nmore, there is a strong presence of SL, UL, and SL-UL \nin this characteristic. This implies an important affinity \nbetween these learning types and the generation of useful \ninformation from raw data. Following a similar trend, there \nseems to be a generalized interest in Environment-Centric \nProcesses, a characteristic that is addressed by almost all of \nthe use cases. However, its low number of papers implies \nthat there are strong research avenues to be explored.\nCommunications addressing the Self-Execution of \nResources and Processes focused exclusively on Process \nControl and Monitoring applications. This shows that \nthe dynamic optimization of working parameters of the \nmachines allows data-driven intelligent resources to be \ncreated. However, this characteristic has further potential \nto be explored in PPC research with other use cases, such \nas in Inventory and Distribution Control with autonomous \nAGVs to serve logistic needs or in quality, by automating \nprocesses.\nConclusion and further research \nperspectives\nThis state-of-the-art analysis studied 93 research articles \nchosen through the logic of a systematic literature review. \nThese papers were analyzed by means of an analytical \nframework composed of four axes. First, the elements of a \nmethod were reviewed, which enabled an analysis of activi-\nties, techniques, and tools to perform a ML-PPC. Secondly, \nthe data sources employed to implement a ML-PPC model \nwere recognized and assessed. Thirdly, an analysis of the \nuse cases enabled the recognition of the applications of \ndata-driven models in the 4.0. Fourthly, the characteristics \nof I4.0 were identified and assessed through their usage. \nAdditionally, a mapping of the scientific literature was pro-\nposed by means of the use cases, characteristics of I4.0 and \nML learning types.\nResults concerning the activities allowed the recogni-\ntion of eleven recurrent tasks that are employed to create a \nML-PPC model. They were grouped in four clusters follow-\ning their use percentage: CUAs (Commonly Used Activi-\nties), OUAs (Often Used Activities), MUAs (Medium Use \nActivities), and SUAs (Seldom Use Activities). From these \nclusters, it can be concluded that activities belonging to the \nCUAs and OUAs clusters are well documented in the scien-\ntific literature. MUAs activities mainly contain data pre-pro-\ncessing tasks, which are necessary but not commonly docu-\nmented by researchers. Finally, the SUAs cluster suggests \nthat there are three activities rarely addressed in literature: \nthe design and implementation of data acquisition methods \nfrom the manufacturing system, the exploration of data to \nget insights, and the constant adaptation of the proposed \nML-PPC model to the environment dynamics.\nAn extensive review of the techniques identified the most \nused families in scientific literature. These were found to \nbe the NN, Q-Learning, DT, Clustering, Regression, and \nEnsemble learning. From these results, a temporal evolu-\ntion analysis of the top 6 most used families was performed. \nFindings suggested a growing interest in NN and Ensemble \nlearning, which motivated a focused study on the detailed \ntechniques encompassed by these families. Concerning the \nNN, the Multi-layer perceptron was the most used technique. \nNevertheless, more specialized deep learning techniques \nsuch as CNNs, LSTMs, and Deep Belief Networks are \n", []], "Cross-axes analysis: mapping the scientific literature through use cases, I4.0 characteristics, and learning types": ["1547\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\npapers), as well as the Knowledge Discovery and Genera-\ntion (26 papers) appear to be moderately boarded. This leads \nto two main conclusions: first, ML-PPC models effectively \nendow manufacturing systems with the capacity of adapting \nto unexpected events and predicting production problems. \nThis is suitable to handle the stochastic nature of production \nenvironments. Secondly, ML is suitable to generate knowl-\nedge from PPC data, which is crucial in I4.0, where data is \nabundant, and it can provide useful guidelines to improve \nthe company’s know-how.\nFour characteristics were rarely satisfied: The Customer-\nCentric Product Development (3 papers), the Self-Execution \nof Resources and Processes (4 papers), the Smart Human \nInteraction (7 papers), and the Environment-Centric Pro-\ncesses (8 papers), which points to strong research perspec-\ntives of ML-PPC applications enabling these features. Con-\ncerning the Customer-Centric Product Development, it was \nrare to find papers including customer-related variables into \ntheir PPC. This can be due to the difficulty to access data \nfrom customers or end users. For instance, as observed in \nthe data sources section, user data was seldom employed.\nThe low number of papers dealing with Self-Execution \nof Resources and Processes suggests that it is unusual to \ncouple the PPC with autonomous physical resources. This \ncan be due to the complexity of such systems as they require \nimportant capital investments as well as multi-disciplinary \nknowledge in production systems, mechatronics, and control \ntheory.\nIt was very surprising to find that the Smart Human \nInteraction (7 papers) and the Environment-Centric Pro-\ncesses (8 papers) are rarely addressed. Indeed, manufactur-\ning systems can be human based in several steps such as \nduring the execution in the shop floor or during the tactical \nplanning definition. Not considering the interaction of the \nproposed ML-PPC models with humans can be harmful for \nthe deployment of the proposed system, as it may worsen \nthe working conditions. Therefore, thinking about this \nhuman-ML interaction is the cornerstone for a successful \nadoption. Concerning the Environment-Centric Processes, \nscarce applications tried to minimize the environmental \nimpact of production processes through ML-PPC. In a \nworld where natural resources are becoming rare, this is \na non-negligible aspect that must be considered, not only \nbecause of the tightening of environmental laws by gov-\nernments but also because of the ethical responsibility of \ncompanies.\nCross‑axes analysis: mapping the scientific literature \nthrough use cases, I4.0 characteristics, and learning \ntypes\nTo address the second objective of this study, a mapping \nof the scientific literature in ML-PPC is proposed. This is \nachieved through a cross-analysis employing the use cases, \ncharacteristics of I4.0, and learning types. Results are repre-\nsented via a cross-matrix having the use cases in the vertical \naxis and the characteristics of I4.0 in the horizontal axis. \nThis matrix also allows the maturity of a given use case to \nbe assessed. For instance, a mature use case in the scientific \nliterature will tend to satisfy more I4.0 characteristics. From \nthis point of view, the crossing between a characteristic of \nI4.0 and a use case will be referred as a domain.\nThe ID numbers defined on Table 2 are employed to place \nthe analyzed articles in the matrix. Additionally, the learn-\ning types employed by each communication are represented \nusing a color code. Figure 12 provides a summarized view of \nthis matrix, allowing for a high-level analysis that will help \nto identify research gaps and trends in ML-PPC. Figure 13 is \nFig. 11   Number of papers by \nI4.0 characteristic\n3\n56\n4\n33\n26\n8\n26\n7\nCustomer-Centric Product Development\nSelf-Organization of Resources\nSelf-Execution of Resources and Processes\nSelf-Regulation of the Production Process\nSelf-Learning of the Production Process\nEnvironment-Centric Processes\nKnowledge Discovery and Generation\nSmart Human Interaction\nNumber of papers\n", [297, 298]], "Fifth research question: the characteristics of I4.0": ["1546\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nstored in information systems by making it available for \nresearchers and practitioners. Furthermore, the use of Equip-\nment and Product data suggests that recent applications \nare starting to employ data coming from IoT technologies \ninstalled in machines or semi-finished products. However, \nthere are still tremendous research gaps when harnessing \nuser data to implement ML-PPC models. Two studies used \nthis data source, but only under the form of expert feedback \nto train the ML model. No study included consumer feed-\nback from e-commerce platforms or social media to influ-\nence the PPC.\nFourth research question: addressed use cases \nby recent scientific literature\nTo answer this question, each analyzed article was allo-\ncated to one of the seven proposed types of use cases. This \nallows to measure their importance in the scientific literature \n(Fig. 10).\nResults point out that Smart Planning and Scheduling is \nthe most addressed use case in recent scientific literature, \nwith nearly half of the communications discussing it. This \nresult may come from two main reasons: firstly, the string \nchains used in the methodology are closely related to this \nuse case; secondly, it normally uses structured data relatively \neasy to get from information systems, which eases the task \nof implementing a data-driven approach. The strong use of \nTime Estimation in ML-PPC (14% of the papers) suggests \nthat classical time measurement methods are not compliant \nwith the growing complexity of the manufacturing systems, \nwhich may represent a pitfall to perform a reliable planning. \nTherefore, ML models considering more diverse variables \nas inputs are being adopted. Moreover, some researchers \nhave addressed the coupling of Smart Maintenance, Process \nControl and Monitoring, and Quality Control with the PPC. \nHowever, there is still effort to be made, as the share of these \nuse cases was no higher than 10%.\nFinally, two use cases are targeted as critical: The Inven-\ntory and Distribution Control (6%) and the Smart Design of \nProducts and Processes (4%). These findings suggest two \nthings: first, a lack of integration of the logistic functions \ninto the ML-PPC, and secondly, a difficulty for harnessing \ninsights from data to serve product and process design. This \ndifficulty is probably because data employed in design is \nhighly unstructured (text data, image data, etc.) and greatly \ndepends on people’s experience.\nFifth research question: the characteristics of I4.0\nTo quantify their usage, the addressed characteristics in \neach of the 93 analyzed papers were identified and counted. \nResults are summarized in Fig. 11. In this figure, the sum \nof all the totals is higher than 93 as one ML-PPC model can \nsatisfy several characteristics.\nFindings show that the Self-Organization of Resources is, \nby far, the most addressed characteristic (56 uses) in ML-\nPPC applications. This result was expected, as this charac-\nteristic can be achieved through production planning and \nscheduling, two functions directly related to the PPC and \nfound to be extensively employed in the use cases. There-\nfore, it can be concluded that the ML-PPC based models \neffectively enable this characteristic.\nThe Self-Regulation of the Production Process (33 \npapers), the Self-Learning of the Production Process (26 \nFig. 10   Share of the analyzed \nsample by proposed use case\n14%\n4%\n48%\n6%\n9%\n9%\n10%\nShare of papers by use case\nTime Estimation\nSmart Design of Products and\nProcesses\nSmart Planning and\nscheduling\nInventory and Distribution\nControl\nProcess Control and\nMonitoring\nQuality Control\nSmart Maintenance\n", []], "Fourth research question: addressed use cases by recent scientific literature": ["1546\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nstored in information systems by making it available for \nresearchers and practitioners. Furthermore, the use of Equip-\nment and Product data suggests that recent applications \nare starting to employ data coming from IoT technologies \ninstalled in machines or semi-finished products. However, \nthere are still tremendous research gaps when harnessing \nuser data to implement ML-PPC models. Two studies used \nthis data source, but only under the form of expert feedback \nto train the ML model. No study included consumer feed-\nback from e-commerce platforms or social media to influ-\nence the PPC.\nFourth research question: addressed use cases \nby recent scientific literature\nTo answer this question, each analyzed article was allo-\ncated to one of the seven proposed types of use cases. This \nallows to measure their importance in the scientific literature \n(Fig. 10).\nResults point out that Smart Planning and Scheduling is \nthe most addressed use case in recent scientific literature, \nwith nearly half of the communications discussing it. This \nresult may come from two main reasons: firstly, the string \nchains used in the methodology are closely related to this \nuse case; secondly, it normally uses structured data relatively \neasy to get from information systems, which eases the task \nof implementing a data-driven approach. The strong use of \nTime Estimation in ML-PPC (14% of the papers) suggests \nthat classical time measurement methods are not compliant \nwith the growing complexity of the manufacturing systems, \nwhich may represent a pitfall to perform a reliable planning. \nTherefore, ML models considering more diverse variables \nas inputs are being adopted. Moreover, some researchers \nhave addressed the coupling of Smart Maintenance, Process \nControl and Monitoring, and Quality Control with the PPC. \nHowever, there is still effort to be made, as the share of these \nuse cases was no higher than 10%.\nFinally, two use cases are targeted as critical: The Inven-\ntory and Distribution Control (6%) and the Smart Design of \nProducts and Processes (4%). These findings suggest two \nthings: first, a lack of integration of the logistic functions \ninto the ML-PPC, and secondly, a difficulty for harnessing \ninsights from data to serve product and process design. This \ndifficulty is probably because data employed in design is \nhighly unstructured (text data, image data, etc.) and greatly \ndepends on people’s experience.\nFifth research question: the characteristics of I4.0\nTo quantify their usage, the addressed characteristics in \neach of the 93 analyzed papers were identified and counted. \nResults are summarized in Fig. 11. In this figure, the sum \nof all the totals is higher than 93 as one ML-PPC model can \nsatisfy several characteristics.\nFindings show that the Self-Organization of Resources is, \nby far, the most addressed characteristic (56 uses) in ML-\nPPC applications. This result was expected, as this charac-\nteristic can be achieved through production planning and \nscheduling, two functions directly related to the PPC and \nfound to be extensively employed in the use cases. There-\nfore, it can be concluded that the ML-PPC based models \neffectively enable this characteristic.\nThe Self-Regulation of the Production Process (33 \npapers), the Self-Learning of the Production Process (26 \nFig. 10   Share of the analyzed \nsample by proposed use case\n14%\n4%\n48%\n6%\n9%\n9%\n10%\nShare of papers by use case\nTime Estimation\nSmart Design of Products and\nProcesses\nSmart Planning and\nscheduling\nInventory and Distribution\nControl\nProcess Control and\nMonitoring\nQuality Control\nSmart Maintenance\n", []], "Third research question: used data sources to implement a ML-PPC": ["1543\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\ntwo learning types. The reason behind this could be that UL \ntechniques are normally used to perform data pre-process-\ning, as with Principal Component Analysis, or discovery of \nhidden patterns in datasets, e.g. with Clustering. There are \n6 papers using just UL, however, this learning type seems to \nunlock all of its potential when used in synergies, allowing \nfor the design of more complex models.\nEven if there are some SL-RL synergies, they are not \nvery common. This is probably because SL is normally \ncoupled with RL when there is a need of performing rapid \nestimations of functions to save computing time. However, it \nseems that most of the applications do not reach a scale that \nneeds this kind of configuration. Finally, it was found that \nusing UL-RL and SL-UL-RL is rare in the scientific litera-\nture. This does not mean that their synergy does not provide \nadvantages, it is just that there may not be a current need \nfor it. Also, it could be that coupling these learning types \nover-complexifies the model design, which prevents its use.\nConcerning the tools, only programming languages or \nsoftware used to implement the ML model were considered. \nTherefore, other tools such as discrete event simulation soft-\nware are out of the scope of this research. Results are pre-\nsented in Fig. 9.\nFor clarity sake, tools being used only once were grouped \nin the category denominated as “Others”. These tools were: \nACE Datamining System, C#, Clementine, GeNIe Modeler, \nHugin 8.1, NetLogo, Neural-SIM, Visual C++, and Xelopes \nLibrary. Additionally, it is important to mention that most \nof the researchers do not mention the tool the use to imple-\nment the models.\nIt could be said that MATLAB is, by far, the most used \ntool to perform ML-PPC in research. Besides its robust cal-\nculation capacity, the reason behind this could be that uni-\nversities often invest in licenses for this software; therefore, \nthey expect their researchers to use this tool. R is the second \nmost used tool, which may be because it is a free software \ntargeting statistical applications, including ML. Finally, the \nthird most used tools are both RapidMiner and Python. The \nformer eases the implementation of ML models thanks to \nits visual programming logic, while the latter is a multipur-\npose programming language recently characterized by its \nML libraries and frameworks such as Scikit-learn, PyToch, \nKeras, etc.\nThird research question: used data sources \nto implement a ML‑PPC\nTo answer this question, the data sources used by each of \nthe analyzed papers were identified. These results are sum-\nmarized in Table 2. The column “Identification” (ID) will \nassign a number to each communication. This will be used \nlater to establish a mapping of the scientific literature.\nResults show that “Artificial data” is the most used data \nsource in recent scientific literature. This probably highlights \nthe difficulty of accessing data coming from companies. \nAdditionally, it is important to remember the extensive use \nof RL techniques. These models normally require constant \naccess to data concerning the real-time status of the produc-\ntion system, which can be difficult to find in real factories. \nTherefore, researchers normally use Artificial or Public \ndata to test their models. This issue could be addressed by \ncreating digital twins, but this still represents a research \nchallenge.\nThe extensive use of artificial data suggests that there \nare data availability issues. This poses two main challenges: \nfirstly, dealing with highly unbalanced datasets when train-\ning, for instance, SL algorithms for classification, and sec-\nondly, accessing enough data to enable good generalization \ncapacity, especially in deep learning models.\nThe first challenge is common when training ML mod-\nels to identify disruptions. In fact, disruptive events in PPC \nsuch as machine breakdowns or quality problems tend to be \nscarce when compared to the total size of the dataset. Thus, \nML techniques struggle to learn these events. To tackle this \nissue, some authors have proposed solutions such as data \naugmentation, a common practice in computer vision that \nconsists of artificially creating new training examples by \nmodifying existent observations (Perez and Wang 2017; \nMikołajczyk and Grochowski 2018). Another approach is \nto use crafted algorithms adapted to class-imbalance. Bi and \nZhang (2018) performed a comprehensive comparison of \n52\n16\n11\n6\n6\n1\n1\nSL\nRL\nSL-UL\nUL\nSL-RL\nUL-RL\nSL-UL-RL\nNumber of uses\nLearning type\nFig. 8   Number of uses by learning type\n41\n14\n9\n7\n6\n6\n5\n3\n3\nNot Mentioned\nMATLAB\nOthers\nR\nRapidMiner\nPython\nJava\nWEKA\nC++\nNumber of uses\nFig. 9   Number of uses by tool\n", []], "Second research question: techniques and tools used in ML-PPC": ["1541\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\n1.\t Commonly Used Activities (CUAs), applied in more \nthan 60% of the analyzed papers (no. 7, 8).\n2.\t Often Used Activities (OUAs), harnessed in 40 to 60% \nof the communications (no. 9, 10).\n3.\t Medium Use Activities (MUAs), employed in 20 to 40% \nof the cases (no. 3–6).\n4.\t Seldom Use Activities (SUAs), used in less than 20% of \nthe reviewed articles (no. 1, 2, 11).\nThese groups show that a considerable amount of research \npapers only focus on the architecture design, training, and \nassessment of ML-PPC models (CUAs cluster), while not \nemploying or documenting the use of other activities. Con-\nsidering OUAs, it is surprising to find that only half of the \ncommunications used the CA, which corresponds to an \nactual implementation of the proposed model in the context \nof the study. This suggests that half of the studies go no \nfurther than just training and evaluating the performance \nof the model.\nMUAs group encompasses data pre-processing tasks, \nwhich are capital to any ML implementation. Even if these \nactivities are frequently employed in practice, their low \nusage is probably because researchers do not mention them, \nimplying a lack of documentation. Moreover, as one of the \ncharacteristics of big data is the variety (in type, nature, for-\nmat, etc.) (Zhou et al. 2017), it is crucial to employ data \npre-processing activities to ensure the quality of the final \nmodels. Consequently, this lack of documentation can repre-\nsent a pitfall to practitioners willing to apply ML-PPC based \non research papers.\nFinally, SUAs cluster highlights the most important \nresearch gaps in scientific literature. Three key findings can \nbe inferred from activities in this group: firstly, the low usage \nof DA highlights the challenge of coupling IoT technolo-\ngies with ML-PPC. This is a major pitfall to deploy ML-\nPPC in companies, as they normally need real-time data or \nstatuses from their manufacturing systems. Secondly, the \nlack of DE utilization could mean that ML-PPC applica-\ntions tend to jump directly to activities in the CUAs cluster \nwhile overlooking descriptive and basic inferential statis-\ntics techniques. This represents an obstacle to generating \nknowledge from data, as DE can draw conclusions easily \ninterpretable by non-ML specialists. Finally, the rare use of \nMU implies that adapting the ML-PPC model to a dynamic \nmanufacturing context is seldom addressed. This unpredict-\nable change of the statistical properties and relationships \nbetween variables over time is known as concept drift (Ham-\nmami et al. 2017). Not addressing this issue can be harmful \nfor the model reliability in the long term.\nSecond research question: techniques and tools \nused in ML‑PPC\nConcerning the techniques, results present the number of \ntimes a given ML model is used. In the case of communica-\ntions comparing several techniques, only the one chosen by \nthe authors because of its better performance was consid-\nered. If this best-performing model employs several tech-\nniques, each of them is counted as used once.\nThere are numerous ML techniques in scientific litera-\nture. Therefore, to ease the analysis of results, a grouping of \ntechniques in families is proposed is Table 1. These families \nwere determined with the help of a ML expert. It is impor-\ntant to mention that the column “Concerned techniques” in \nTable 1 is not an exhaustive list, it is limited to techniques \nfound in the systematic literature review.\nResults are presented in Fig. 7. They suggest that NN, \nQ-Learning, and DT are the most used techniques in ML-\nPPC. The extensive use of NN is probably due to their abil-\nity to learn complex non-linear relationships between vari-\nables, often delivering good performance when compared \nto other techniques. Even if Q-Learning remains, by far, the \nmost used RL technique, other RL models such as Sarsa \nor R-Learning are used, which points an interest in agent-\nbased modeling in ML-PPC. Finally, the attention drawn by \nDT techniques is probably linked to their excellent trade-off \nbetween accuracy and interpretability, allowing knowledge \ngeneration.\nThe high use of Clustering techniques could be explained \nby the fact that data in manufacturing systems is normally \nunlabeled and can contain meaningful unknown patterns. \nTherefore, clustering can be employed to discover groups \nas well as hidden structures in datasets.\nThe usage evolution of the six most used technique fam-\nilies was also measured. Figures representing this can be \nfound in “Appendix II”. Due to an imbalance in the amount \nof articles over the different years, results are presented as \nrelative frequencies. For example, if the NN achieved a \nusage of 27% in 2018, it means that 27% of all the techniques \nused in that year corresponded to such a model. Results sug-\ngest that there is a strong growth in the use of NN since \n2015, this is possibly due to the growing computing power, \nrecent findings in terms of architectures such as CNNs or \nLSTMs, and the development of specialized frameworks like \nPyTorch, TensorFlow, Keras, etc. which ease the task of \nimplementing such models. Moreover, results show a grow-\ning interest on Ensemble learning techniques which evolved \nfrom not being used between 2011 and 2013 to accounting \nfor 14% of applications in 2018. This can possibly explain \nthe loss of interest on DT since 2017, as Random forests (a \ntype of Ensemble learning) can achieve better performance \nby using committees of decision trees.\n", []], "First research question: activities employed in ML-PPC": ["1539\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\ninformation or measured data. It is the case of machines \nautomatically adapting their functioning parameters to \nwork optimally or trolleys automatically replenishing \nworkstations when these reach a certain level of security \nstock.\n4.\t Self-Regulation of the Production Process: unexpected \nevents should be effectively handled in the I4.0. Thus, \nthis characteristic concerns the capability to perform the \nrequired adjustments to respond to unpredicted prob-\nlems. For example, relaunching the scheduling process \nfor a certain production line when one of the machines \nexperienced a breakdown.\n5.\t Self-Learning of the Production Process: this charac-\nteristic follows a similar logic as the self-regulation of \nprocesses in terms of adjustability. However, it relates \nto the capacity of the production system to adapt to pre-\ndicted events. It is the case of predictive maintenance, \nwhich uses BDA to estimate the remaining useful life of \nmachine’s components. Afterwards, the manufacturing \nsystem can adapt to the results of this prediction.\nAfter concluding the analysis of the 93 articles, three char-\nacteristics seem to be overlooked: the environmental dimen-\nsion, the knowledge generation, and the inclusion of the \nhuman being. To consider these dimensions that seem to \nnot be explicitly raised in the work of Tao et al. (2018), three \nnew characteristics are proposed:\n6.\t Environment-Centric Processes: estimations suggest that \nthe electronics and home appliances industry scrapped \naround 100 million goods in China in 2012 (Tian et al. \n2013). As exemplified, the environmental impact of \nindustry is far from being negligible, which is the reason \nwhy industrialized countries have started to tighten regu-\nlations and engage environmentally friendly practices in \nmanufacturing (Tuncel et al. 2014). Research done in the \ncontext of I4.0 must not overlook this aspect. Therefore, \nthis characteristic concerns the use of new technologies \nto create environment-centric processes. For example, \noptimizing the disassembly scheduling process to maxi-\nmize the number of components that can be recycled.\n7.\t Knowledge Discovery and Generation: most of the com-\npanies have been computerized for a long time, which \nhas eased the collection of data. Despite the access to a \nplethora of information systems, generating knowledge \nfrom raw data still supposes a major industrial and aca-\ndemic challenge. Besides, the generation of knowledge \nis a mandatory step to improve the adoption of BDA by \ncompanies (Grabot 2018). In fact, knowledge could be \nconsidered as one of the most valuable assets in manu-\nfacturing (Harding et al. 2006), the reason why generat-\ning it represents an important gain behind the adoption \nof BDA. Therefore, as I4.0 is characterized by allowing \nknowledge creation, research efforts must include it to \ngenerate value. One example of this is harnessing data \nfrom maintenance reports to provide the production of \nresponsible real-time information about the root causes \nof machine breakdowns.\n8.\t Smart Human Interaction: even with the advent of multi-\nple I4.0 technologies, its adoption would be significantly \nhindered by not keeping humans in the loop or not con-\nsidering their interaction with the proposed solutions. \nFor instance, Thomas et al. (2018a) experienced the \ncase of a company that was not willing to introduce an \nimproved version of a quality control system because it \nsomehow excluded the person from the process. There-\nfore, this characteristic concerns the consideration and/\nor inclusion of a human being when implementing \nnew technologies. Examples of this would be a worker \nbehavior recognition system based on computer vision \nor software interacting with operators through NLP.\nFigure 5 summarizes this section. It also presents the \nrelationship between the Research Questions (RQ), the \nanalytical framework axes, the research objectives, and the \nexpected outputs of this study.\nResults\nFirst research question: activities employed \nin ML‑PPC\nTo identify the activities, the tasks used to implement a \nML-PPC in each of the 93 communications were identified. \nAfterwards, these tasks were grouped into categories to ease \nthe information analysis. These groups of activities were \nanalyzed by two experts to keep the most meaningful ones. \nResults suggest eleven standard and recurrent activities:\n\t 1.\t Data Acquisition system design and integration (DA): \ndesign and implementation of IoT systems to collect \ndata. This activity also encompasses the data storage \nand communication protocols.\n\t 2.\t Data Exploration (DE): use of data visualization tech-\nniques, inferential statistics, and others to derive initial \ninsights and conclusions about the dataset.\n\t 3.\t Data Cleaning and formatting (DC): data preparation \nfrom the raw data to make it exploitable by the ML-\nPPC model. It concerns tasks such as outlier removal \nor missing values handling.\n\t 4.\t Feature Selection (FS): choice of the most suitable \ninputs to the ML-PPC model. It can be done through \nstatistical techniques, e.g. stepwise regression or by \nmeans of expert insight.\n", [133]], "Results": ["1539\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\ninformation or measured data. It is the case of machines \nautomatically adapting their functioning parameters to \nwork optimally or trolleys automatically replenishing \nworkstations when these reach a certain level of security \nstock.\n4.\t Self-Regulation of the Production Process: unexpected \nevents should be effectively handled in the I4.0. Thus, \nthis characteristic concerns the capability to perform the \nrequired adjustments to respond to unpredicted prob-\nlems. For example, relaunching the scheduling process \nfor a certain production line when one of the machines \nexperienced a breakdown.\n5.\t Self-Learning of the Production Process: this charac-\nteristic follows a similar logic as the self-regulation of \nprocesses in terms of adjustability. However, it relates \nto the capacity of the production system to adapt to pre-\ndicted events. It is the case of predictive maintenance, \nwhich uses BDA to estimate the remaining useful life of \nmachine’s components. Afterwards, the manufacturing \nsystem can adapt to the results of this prediction.\nAfter concluding the analysis of the 93 articles, three char-\nacteristics seem to be overlooked: the environmental dimen-\nsion, the knowledge generation, and the inclusion of the \nhuman being. To consider these dimensions that seem to \nnot be explicitly raised in the work of Tao et al. (2018), three \nnew characteristics are proposed:\n6.\t Environment-Centric Processes: estimations suggest that \nthe electronics and home appliances industry scrapped \naround 100 million goods in China in 2012 (Tian et al. \n2013). As exemplified, the environmental impact of \nindustry is far from being negligible, which is the reason \nwhy industrialized countries have started to tighten regu-\nlations and engage environmentally friendly practices in \nmanufacturing (Tuncel et al. 2014). Research done in the \ncontext of I4.0 must not overlook this aspect. Therefore, \nthis characteristic concerns the use of new technologies \nto create environment-centric processes. For example, \noptimizing the disassembly scheduling process to maxi-\nmize the number of components that can be recycled.\n7.\t Knowledge Discovery and Generation: most of the com-\npanies have been computerized for a long time, which \nhas eased the collection of data. Despite the access to a \nplethora of information systems, generating knowledge \nfrom raw data still supposes a major industrial and aca-\ndemic challenge. Besides, the generation of knowledge \nis a mandatory step to improve the adoption of BDA by \ncompanies (Grabot 2018). In fact, knowledge could be \nconsidered as one of the most valuable assets in manu-\nfacturing (Harding et al. 2006), the reason why generat-\ning it represents an important gain behind the adoption \nof BDA. Therefore, as I4.0 is characterized by allowing \nknowledge creation, research efforts must include it to \ngenerate value. One example of this is harnessing data \nfrom maintenance reports to provide the production of \nresponsible real-time information about the root causes \nof machine breakdowns.\n8.\t Smart Human Interaction: even with the advent of multi-\nple I4.0 technologies, its adoption would be significantly \nhindered by not keeping humans in the loop or not con-\nsidering their interaction with the proposed solutions. \nFor instance, Thomas et al. (2018a) experienced the \ncase of a company that was not willing to introduce an \nimproved version of a quality control system because it \nsomehow excluded the person from the process. There-\nfore, this characteristic concerns the consideration and/\nor inclusion of a human being when implementing \nnew technologies. Examples of this would be a worker \nbehavior recognition system based on computer vision \nor software interacting with operators through NLP.\nFigure 5 summarizes this section. It also presents the \nrelationship between the Research Questions (RQ), the \nanalytical framework axes, the research objectives, and the \nexpected outputs of this study.\nResults\nFirst research question: activities employed \nin ML‑PPC\nTo identify the activities, the tasks used to implement a \nML-PPC in each of the 93 communications were identified. \nAfterwards, these tasks were grouped into categories to ease \nthe information analysis. These groups of activities were \nanalyzed by two experts to keep the most meaningful ones. \nResults suggest eleven standard and recurrent activities:\n\t 1.\t Data Acquisition system design and integration (DA): \ndesign and implementation of IoT systems to collect \ndata. This activity also encompasses the data storage \nand communication protocols.\n\t 2.\t Data Exploration (DE): use of data visualization tech-\nniques, inferential statistics, and others to derive initial \ninsights and conclusions about the dataset.\n\t 3.\t Data Cleaning and formatting (DC): data preparation \nfrom the raw data to make it exploitable by the ML-\nPPC model. It concerns tasks such as outlier removal \nor missing values handling.\n\t 4.\t Feature Selection (FS): choice of the most suitable \ninputs to the ML-PPC model. It can be done through \nstatistical techniques, e.g. stepwise regression or by \nmeans of expert insight.\n", []], "Fourth axis of the analytical framework: the characteristics of I4.0": ["1538\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nThe analysis of the 93 shortlisted articles suggested that \nsome of them did not fit into the five data sources proposed \nby Tao et al. (2018): these communications used artificially \ngenerated data through computer simulations. Therefore, a \nsixth data source is proposed, which corresponds to the first \ncontribution of this paper to the scientific literature:\n6.\t Artificial data (A): data generated by computers (e.g. \nsimulations) to assess ML-PPC implementations.\nThird axis of the analytical framework: the use cases \nof the ML‑PPC in the I4.0\nThis axis concerns the fourth question: it aims to show \nwhich applications can be achieved when applying a ML-\nPPC. Moreover, identifying the use cases and quantifying \ntheir use frequency is important to detect trends as well as \nfurther research gaps. By use cases, this study refers to the \ndifferent possible applications in a certain domain, such as \nmaintenance, quality control, distribution, etc. In fact, as \nthe PPC is entwined with several manufacturing subjects, \nis difficult to perform a complete review on PPC if these \ntopics are ignored. For example, if there were a predictive \nmaintenance study meant to enable a more robust produc-\ntion scheduling, such application would be directly related \nto the PPC through maintenance. To start this analysis, the \nuse cases of I4.0 initially proposed by Tao et al. (2018) were \nconsidered. They identified six of them:\n1.\t Smart Maintenance: harnessing data to perform preven-\ntive and predictive maintenance. For instance, monitor-\ning machine components to estimate the best date to \nperform a maintenance intervention.\n2.\t Quality Control: applying BDA to supervise the manu-\nfacturing process or products, seeking for possible qual-\nity problems and/or allowing the identification of root \ncauses.\n3.\t Process Control and Monitoring: constantly analyzing \ndata coming from the shop floor to perform a smart \nadjustment of the functioning parameters of physical \nresources (machines, AGVs, etc.). The objective is to \nautomatically control these physical resources and/or \noptimize their parameters with respect to the working \nconditions.\n4.\t Inventory and Distribution Control: stock management, \nparts and tools tracking, and distribution control with \nthe use real-time and/or historical data.\n5.\t Smart Planning and Scheduling: considering produc-\ntion uncertainties to perform a production planning and \nscheduling closer to the current state of the production \nsystem. For instance, considering unexpected mainte-\nnance problems to reschedule a production order and \nminimize the delay.\n6.\t Smart Design of Products and Processes: using BDA to \nsupport new products and processes development. For \ninstance, using NLP to analyze the technical require-\nments of a new product and then to propose the poten-\ntially suitable manufacturing process.\nThe analysis of the 93 scientific articles suggests that these \nsix use cases are not enough to fully characterize the recent \npublications. Additionally, papers not fitting in the initially \nproposed use cases shared the same application: time esti-\nmation (cycle time, operation time, etc.). Consequently, a \nseventh use case is proposed:\n7.\t Time estimation: adaptation of different manufactur-\ning related times to current working conditions. For \ninstance, estimating the operation times to the actual \nwork rate of each employee instead of using the data \nfrom the Method Time Measurement (MTM) approach.\nFourth axis of the analytical framework: \nthe characteristics of I4.0\nThe I4.0 aims to transform the collected data during the \nproduct’s lifecycle into “intelligence” to enhance the manu-\nfacturing process (Tao et al. 2018). With this transforma-\ntion, the objective is to reduce costs while improving the \nquality, productivity, sustainability of the production system \n(Wang et al. 2018a). However, what specific benefits could \nbe expected when embracing the I4.0? To answer this ques-\ntion, the characteristics of I4.0 need to be identified. Tao \net al. (2018) argue that I4.0 enables the following paradigms:\n1.\t Customer-Centric Product Development: production \nsystems in the I4.0 should be able to adjust their param-\neters by considering variables coming from customers \nsuch as their behavior, their needs, the way they use the \nproducts, inter alia. It is the case of manufacturing per-\nsonalized products, designing processes from the cus-\ntomer requirements or proposing a target manufacturing \ncost for each consumer profile.\n2.\t Self-Organization of Resources: I4.0 should endow pro-\nduction systems with the capacity of considering data \ncoming from the manufacturing process to better engage \nthe available resources. Additionally, this data should \nalso be used to plan capital and operational expendi-\ntures. For example, updating the scheduling of machines \nthe shop floor after new urgent order is released.\n3.\t Self-Execution of Resources and Processes: in the I4.0, \nresources should become “smart” by providing them a \nreal-time awareness and interaction capacity with the \nmanufacturing environment (Huang et al. 2019). There-\nfore, the self-execution of resources concerns their fac-\nulty of making decisions depending on the received \n", []], "Third axis of the analytical framework: the use cases of the ML-PPC in the I4.0": ["1538\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nThe analysis of the 93 shortlisted articles suggested that \nsome of them did not fit into the five data sources proposed \nby Tao et al. (2018): these communications used artificially \ngenerated data through computer simulations. Therefore, a \nsixth data source is proposed, which corresponds to the first \ncontribution of this paper to the scientific literature:\n6.\t Artificial data (A): data generated by computers (e.g. \nsimulations) to assess ML-PPC implementations.\nThird axis of the analytical framework: the use cases \nof the ML‑PPC in the I4.0\nThis axis concerns the fourth question: it aims to show \nwhich applications can be achieved when applying a ML-\nPPC. Moreover, identifying the use cases and quantifying \ntheir use frequency is important to detect trends as well as \nfurther research gaps. By use cases, this study refers to the \ndifferent possible applications in a certain domain, such as \nmaintenance, quality control, distribution, etc. In fact, as \nthe PPC is entwined with several manufacturing subjects, \nis difficult to perform a complete review on PPC if these \ntopics are ignored. For example, if there were a predictive \nmaintenance study meant to enable a more robust produc-\ntion scheduling, such application would be directly related \nto the PPC through maintenance. To start this analysis, the \nuse cases of I4.0 initially proposed by Tao et al. (2018) were \nconsidered. They identified six of them:\n1.\t Smart Maintenance: harnessing data to perform preven-\ntive and predictive maintenance. For instance, monitor-\ning machine components to estimate the best date to \nperform a maintenance intervention.\n2.\t Quality Control: applying BDA to supervise the manu-\nfacturing process or products, seeking for possible qual-\nity problems and/or allowing the identification of root \ncauses.\n3.\t Process Control and Monitoring: constantly analyzing \ndata coming from the shop floor to perform a smart \nadjustment of the functioning parameters of physical \nresources (machines, AGVs, etc.). The objective is to \nautomatically control these physical resources and/or \noptimize their parameters with respect to the working \nconditions.\n4.\t Inventory and Distribution Control: stock management, \nparts and tools tracking, and distribution control with \nthe use real-time and/or historical data.\n5.\t Smart Planning and Scheduling: considering produc-\ntion uncertainties to perform a production planning and \nscheduling closer to the current state of the production \nsystem. For instance, considering unexpected mainte-\nnance problems to reschedule a production order and \nminimize the delay.\n6.\t Smart Design of Products and Processes: using BDA to \nsupport new products and processes development. For \ninstance, using NLP to analyze the technical require-\nments of a new product and then to propose the poten-\ntially suitable manufacturing process.\nThe analysis of the 93 scientific articles suggests that these \nsix use cases are not enough to fully characterize the recent \npublications. Additionally, papers not fitting in the initially \nproposed use cases shared the same application: time esti-\nmation (cycle time, operation time, etc.). Consequently, a \nseventh use case is proposed:\n7.\t Time estimation: adaptation of different manufactur-\ning related times to current working conditions. For \ninstance, estimating the operation times to the actual \nwork rate of each employee instead of using the data \nfrom the Method Time Measurement (MTM) approach.\nFourth axis of the analytical framework: \nthe characteristics of I4.0\nThe I4.0 aims to transform the collected data during the \nproduct’s lifecycle into “intelligence” to enhance the manu-\nfacturing process (Tao et al. 2018). With this transforma-\ntion, the objective is to reduce costs while improving the \nquality, productivity, sustainability of the production system \n(Wang et al. 2018a). However, what specific benefits could \nbe expected when embracing the I4.0? To answer this ques-\ntion, the characteristics of I4.0 need to be identified. Tao \net al. (2018) argue that I4.0 enables the following paradigms:\n1.\t Customer-Centric Product Development: production \nsystems in the I4.0 should be able to adjust their param-\neters by considering variables coming from customers \nsuch as their behavior, their needs, the way they use the \nproducts, inter alia. It is the case of manufacturing per-\nsonalized products, designing processes from the cus-\ntomer requirements or proposing a target manufacturing \ncost for each consumer profile.\n2.\t Self-Organization of Resources: I4.0 should endow pro-\nduction systems with the capacity of considering data \ncoming from the manufacturing process to better engage \nthe available resources. Additionally, this data should \nalso be used to plan capital and operational expendi-\ntures. For example, updating the scheduling of machines \nthe shop floor after new urgent order is released.\n3.\t Self-Execution of Resources and Processes: in the I4.0, \nresources should become “smart” by providing them a \nreal-time awareness and interaction capacity with the \nmanufacturing environment (Huang et al. 2019). There-\nfore, the self-execution of resources concerns their fac-\nulty of making decisions depending on the received \n", []], "Second axis of the analytical framework: employed data sources": ["1537\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\nemployed by other authors to propose methodologies in \nresearch domains such as product development (Lemieux \net al. 2015) and lean in hospitals (Curatolo et al. 2014). \nMoreover, (Talhi et al. 2017) suggested its use to develop a \nmethodology in the context of cloud manufacturing applied \nto product lifecycle management. Thus, the MEM suits the \nfirst objective of this study, which concerns the definition \nof a methodology to implement a ML-PPC. There are five \nelements in the MEM:\n1.\t A procedure: order of activities to be followed when the \nmethod is employed.\n2.\t Techniques: the means to generate the results. Activities \nfrom the procedure are supported by techniques, while \nthe latter is supported by tools.\n3.\t Results: they correspond to the output of an activity.\n4.\t Role: the point of view adopted by the person who per-\nforms the activity and is responsible for it.\n5.\t Information model: this refers to the relation between \nthe first four mandatory elements.\nIn the scope of this study, the first two elements are the con-\ncern. Firstly, to evaluate the procedure, the activities used \nto perform a ML-PPC implementation will be recognized \nand their use will be measured. By activities, this research \nrefers to tasks such as “model comparison and selection” or \n“data cleaning”. Secondly, to address the techniques, ML \nmodels and tools will be identified, and their use will be \nmeasured. ML models point to elements such as Support \nVector Machines or Neural Networks, while tools relate to \nprogramming languages or software used to implement these \nML models.\nTo provide further insight concerning the ML techniques, \nthe learning types will also be measured. This will be used to \nsummarize the information regarding the techniques as well \nas to ease the identification of trends and research perspec-\ntives. Additionally, the learning types will serve as a bridge \nbetween the first and second objectives of this study, as they \nwill be used in the mapping to classify scientific literature. \nBased on the work of Jordan and Mitchell (2015), three main \nlearning types can be identified:\n1.\t Supervised Learning (SL), which concerns ML tech-\nniques approximating a function f(X) = Y by learning \nthe relationship between the inputs X and the outputs \nY . For instance, learning the mapping between the Red \nGreen, and Blue (RGB) codes (input X ) in an image \nand the objects in it (output Y ) to determine if a certain \npicture contains a misplaced product in a stock rack.\n2.\t Unsupervised Learning (UL), which encompasses tech-\nniques allowing data exploration to find patterns and \nhidden structures in a given dataset X . For instance, \nfinding categories in maintenance reports by using the \ndescription of the problem and the duration of the main-\ntenance intervention.\n3.\t Reinforcement Learning (RL), which are techniques \nallowing the learning of actions to be performed by an \nagent interacting with a certain environment to maxi-\nmize a reward. For example, teaching an Automated \nGuided Vehicle (AGV) in a warehouse how to avoid \nobstacles to maximize the number of delivered pack-\nages.\nSecond axis of the analytical framework: employed \ndata sources\nThis axis addresses the third research question: the har-\nnessed data sources. Identifying which are the data sources \nused to perform a ML-PPC is capital. In fact, data could \nbe considered as the raw material allowing ML models to \ndevelop autonomous computer knowledge gain (Sharp et al. \n2018). Moreover, the quality of the final model will depend \nto a great extent on the quality and appropriateness of the \nused data. Therefore, the choice of the data source is an \nimportant decision when training a ML model. To address \nthis axis of the analytical framework, the data source types \nproposed by Tao et al. (2018) will be used. They mention \nthat there are five main data sources used in the data-driven \nsmart manufacturing:\n1.\t Management data (M): historical data coming from com-\npany’s information systems such as the ERP, Manufac-\nturing Execution System (MES), Customer Relationship \nManagement system (CRM), etc. M data will concern \nproduction planning, maintenance, logistics, customer \ninformation, etc.\n2.\t Equipment data (E): data coming from Internet of \nThings (IoT) technologies implemented in the factory. \nIt refers to sensors installed in physical resources such \nas machines, places such as workstations or human \nresources such as workers. In the case of workers, data \nis collected passively, such as by RFID sensors installed \non helmets.\n3.\t User data (U): consumer information collected from \ne-commerce platforms, social media, etc. It also encom-\npasses feedback given by workers or experts that will \nbe used to train the ML-PPC model. User data coming \nfrom workers is collected actively, for example through \ninterviews or questionnaires.\n4.\t Product data (P): data originating from products or ser-\nvices either during the production process or from the \nfinal consumer.\n5.\t Public data (Pb): data available in public databases from \nuniversities, governments or from other researchers.\n", []], "First axis of the analytical framework: the elements of a method": ["1536\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nLearning” OR “Machine Learning” provides a more recent \naverage publication year (2017.06) for the item “Machine \nLearning” than with the other two queries: 2016.95 when \nquerying with “Data Mining” and 2016.41 when querying \nwith “Statistical Learning”. Finally, “Deep Learning” OR \n“Machine Learning” was the only query enabling the inclu-\nsion of the item “Deep Learning” with enough occurrences \n(25) to pass the filter, which is a recent research topic with \nan average publication year of 2018.28.\nFrom the bibliometric analysis, it could be concluded that \nusing “Deep Learning” OR “Machine Learning” as part of \nthe query keywords is appropriate enough, as this allows for \nthe identification of a big sample of recent papers, enabling \nthe identification of new trends. It seems that “Statistical \nLearning” does not provide enough recent results to be con-\nsidered. Finally, even if “Data Mining” is closely related to \n“Machine Learning,” it covers a vast domain that can deviate \nfrom the focus of this review.\nRegarding the keywords employed in the second paren-\nthesis of the string chains, the objective was to represent the \nmain functions of the PPC under the definition provided in \nthe introduction section. Consequently, a determination of \nthe global production quantities was represented by “Produc-\ntion Planning” and the aspect of the main objectives (i.e. \nprofitability, productivity, and delivery time) was depicted \nby “Production Control”. Finally, the real time synchroni-\nzation of resources as well as product customizations were \nrepresented by both “Production Scheduling” and “Line \nBalancing,” given the fact that companies should be able to \nperform balanced scheduling even when facing customized \nclient orders.\nAs the PPC is a transverse topic tangled with other func-\ntions such as maintenance, quality control, logistics, etc., the \nchallenge was to decide whether or not these related subjects \nshould be included as explicit keywords for the queries. The \nfinal choice was to not include them through keywords, as \nthis would broaden the perimeter of the research too much, \nlosing a focus on PPC. Nevertheless, it was decided to \ninclude, in the final article sample, the studies dealing with \nother functions only if they were related to the PPC.\nAnalytical framework\nThis section presents the four axes that build the analytical \nframework that will be employed to harness knowledge and \ninsight from the final sample of 93 scientific articles.\nFirst axis of the analytical framework: the elements \nof a method\nThis axis concerns the first and second research questions: \nthe activities, techniques, and tools to implement a ML-PPC \nmodel. To link these three elements, the concept of “Man-\ndatory Elements of a Method” (MEM) proposed by Zellner \n(2011) is used. In fact, this concept has been successfully \nFig. 4   Network visualization with the average publication year for “Statistical Learning”\n", [72]], "Analytical framework": ["1536\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nLearning” OR “Machine Learning” provides a more recent \naverage publication year (2017.06) for the item “Machine \nLearning” than with the other two queries: 2016.95 when \nquerying with “Data Mining” and 2016.41 when querying \nwith “Statistical Learning”. Finally, “Deep Learning” OR \n“Machine Learning” was the only query enabling the inclu-\nsion of the item “Deep Learning” with enough occurrences \n(25) to pass the filter, which is a recent research topic with \nan average publication year of 2018.28.\nFrom the bibliometric analysis, it could be concluded that \nusing “Deep Learning” OR “Machine Learning” as part of \nthe query keywords is appropriate enough, as this allows for \nthe identification of a big sample of recent papers, enabling \nthe identification of new trends. It seems that “Statistical \nLearning” does not provide enough recent results to be con-\nsidered. Finally, even if “Data Mining” is closely related to \n“Machine Learning,” it covers a vast domain that can deviate \nfrom the focus of this review.\nRegarding the keywords employed in the second paren-\nthesis of the string chains, the objective was to represent the \nmain functions of the PPC under the definition provided in \nthe introduction section. Consequently, a determination of \nthe global production quantities was represented by “Produc-\ntion Planning” and the aspect of the main objectives (i.e. \nprofitability, productivity, and delivery time) was depicted \nby “Production Control”. Finally, the real time synchroni-\nzation of resources as well as product customizations were \nrepresented by both “Production Scheduling” and “Line \nBalancing,” given the fact that companies should be able to \nperform balanced scheduling even when facing customized \nclient orders.\nAs the PPC is a transverse topic tangled with other func-\ntions such as maintenance, quality control, logistics, etc., the \nchallenge was to decide whether or not these related subjects \nshould be included as explicit keywords for the queries. The \nfinal choice was to not include them through keywords, as \nthis would broaden the perimeter of the research too much, \nlosing a focus on PPC. Nevertheless, it was decided to \ninclude, in the final article sample, the studies dealing with \nother functions only if they were related to the PPC.\nAnalytical framework\nThis section presents the four axes that build the analytical \nframework that will be employed to harness knowledge and \ninsight from the final sample of 93 scientific articles.\nFirst axis of the analytical framework: the elements \nof a method\nThis axis concerns the first and second research questions: \nthe activities, techniques, and tools to implement a ML-PPC \nmodel. To link these three elements, the concept of “Man-\ndatory Elements of a Method” (MEM) proposed by Zellner \n(2011) is used. In fact, this concept has been successfully \nFig. 4   Network visualization with the average publication year for “Statistical Learning”\n", [72]], "A brief focus on the query keywords": ["1533\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\t\n1 3\nHowever, these references were not chosen through a sys-\ntematic literature review. Finally, (Sharp et al. 2018) could \nbe considered as a study close to this paper as the authors \nused a pre-defined methodology to select the articles to ana-\nlyze. Nevertheless, they employed Natural Language Pro-\ncessing (NLP) to analyze around 4000 unique articles and \nprovide insights about the scientific literature of ML applied \nin I4.0. The use of NLP can be useful to identify important \ntrends, but it does not allow the authors to analyze the detail \nof the reviewed papers, where it is likely to find interesting \nresearch gaps and insights. On the other hand, a systematic \nreview allows the authors to both follow a rigorous method-\nology and perform a detailed study of each chosen article.\nEven though the PPC is closely related to the domain \nof supply chain, the latter is not included in the scope of \nthis review as its vastness would increase the risk of stray-\ning from the focus on PPC. Therefore, to learn about recent \ntrends on this topic, the authors invite readers to refer to \nHosseini et al. (2019), who performed a comprehensive \nreview of quantitative methods, technologies, definitions, \nand key drivers of supply chain resilience. In fact, supply \nchain resilience is a growing research area that examines \nthe ability of a supply chain to respond to disruptive events \n(Hosseini et al. 2019). Applications of this topic have been \ndone by Hosseini and Barker (2016), who applied Bayesian \nnetworks to perform supplier selection based on primary, \ngreen, and resilience criteria; and Hosseini and Ivanov \n(2019), who proposed a method using Bayesian networks to \nassess the resilience of suppliers in identifying critical links \nin a supply network.\nThe queries were performed between 10/10/2018 and \n24/03/2019 in two scientific databases: ScienceDirect and \nSCOPUS. The following keywords conducted the research:\n•\t (“Deep Learning” OR “Machine Learning”) AND (“Pro-\nduction scheduling”)\n•\t (“Deep Learning” OR “Machine Learning”) AND (“Pro-\nduction planning”)\n•\t (“Deep Learning” OR “Machine Learning”) AND (“Pro-\nduction control”)\n•\t (“Deep Learning” OR “Machine Learning”) AND (“Line \nbalancing”)\nTo consider the context of I4.0, only papers published since \n2011 were considered because this year corresponds to the \nformal introduction of I4.0 at the Hannover Fair. Addition-\nally, only communications labeled as “Research Articles” \nin ScienceDirect and “Conference paper” OR “Article” in \nSCOPUS were included to solely capture articles present-\ning application models. Subsequently, a review of titles and \nabstracts allowed for the exclusion of articles not related to \nML-PPC. After the removal of duplicates, a full text analysis \nallowed a final selection that excluded papers that did not fit \nwith research questions. The sample size obtained encom-\npasses 93 scientific papers. The article selection methodol-\nogy with its Restrictions (R) is described in Fig. 1.\nA brief focus on the query keywords\nThe used string chains represent a core strategic choice for \nreview. Therefore, this sub section aims to provide an analy-\nsis of the employed keywords.\nConcerning the keywords used in the first parenthesis of \nthe string chains, the use of “Deep Learning” and “Machine \nLearning” was done for two reasons: firstly, they are rela-\ntively new terms, which eases the identification of recent \ntrends in the literature; and secondly, they are directly related \nto one of the two core subjects in this study, which is ML. \nOther terms such as “Data Mining” or “Statistical Learn-\ning” could have been sensible choices too, as they are often \nused interchangeably with “Machine Learning” and “Deep \nLearning”. Nevertheless, using these two terms might have \ndeviated this study from its core topic. In fact, a recent study \nsuggests that the differences between ML and Data Min-\ning are not consistently defined in the literature. Thus, Data \nMining is mostly considered to be the process of generat-\ning useful knowledge from data (Schuh et al. 2019). To do \nso, it draws from other fields such as Artificial Intelligence, \nStatistics, ML, and Data Analytics. Therefore, Data Mining \ncan be a vast topic, and does not exclusively concern ML, \nwhich could potentially affect the focus of this study. As \nthere seems to be no clear boundary between these terms, \na short bibliometric analysis was performed to assess the \nchosen keywords. The analysis was done using VOSviewer, \nsoftware developed by the University of Leiden to draw \ninsights from scientific literature. Furthermore, using key-\nwords related to specific ML techniques such as “Random \nForest” or “k-means” did not seem appropriate due to \nthe risk of introducing a bias when answering the second \nresearch question. In fact, this could have artificially boosted \nthe results of the queried techniques.\nThe bibliometric analysis followed a similar methodology \nto that used to choose the final article sample (cf. Fig. 1). \nThe objective was to briefly assess the influence of differ-\nent keywords on the queries’ results. For the analysis, three \ndifferent string chains were considered: “Deep Learning” \nOR “Machine Learning”, “Data Mining”, and “Statistical \nLearning”. The queries were performed on 06/10/2019 and \nthe detail of the search strategy can be found in “Appendix \nI”. Finally, as the aim is to analyze the available literature \nwhen querying with a certain string chain, no Title and \nabstract review was done as this could introduce a bias into \nthe results due to the authors’ influence.\nThe bibliometric analysis focused on the keywords \ndefined by the authors for all of the papers of each of \nthe three samples. To represent the results, the network \n", [55, 63, 64, 72]], "Research methodology and contribution": ["1532\n\t\nJournal of Intelligent Manufacturing (2020) 31:1531–1558\n1 3\nfor example in the European Union around €7 billion will be \ninvested by 2020 in Factories of the Future (Kusiak 2017).\nAmong the Industry 4.0 groups of technologies (Ruess-\nmann et al. 2015), Big Data and Analytics (BDA) allows the \nconstantly growing mass of produced data to be harnessed \nto generate added value. In fact, data generation in modern \nmanufacturing has undergone explosive growth, reaching \naround 1000 Exabytes per year (Tao et al. 2018). However, \nthe potential of this data has been found to be insufficiently \nexploited by companies (Manns et al. 2015; Moeuf et al. \n2018). As BDA enables the exploitation of data, the scope \nof this review will focus on this technology, and more spe-\ncifically ML applied in Production Planning and Control.\nIn the context of I4.0, Production Planning and Control \n(PPC) can be defined as the function determining the global \nquantities to be produced (production plan) to satisfy the \ncommercial plan and to meet the profitability, productivity \nand delivery time objectives. It also encompasses the con-\ntrol of production process, allowing real-time synchroniza-\ntion of resources as well as product customization (Tony \nArnold et al. 2012; Moeuf et al. 2018). In this review, I4.0 \nis considered a synonym of Smart Manufacturing, as they \nboth refer to technological advances that value data to draw \nimprovements in production. For example, Ruessmann et al. \n(2015) proposed nine technologies for I4.0 while Kusiak \n(2019) suggested six, but for Smart Manufacturing. Both \nproposals tend to refer to similar technologies and variations \ndepend on the authors’ focus. Hence, as the PPC is a core \nfunction of manufacturing, this paper regards its improve-\nment through I4.0 technologies, namely ML, which concerns \nBDA. Regarding ML, the definition that will be retained is \nthe one of a computer program capable of learning from \nexperience to improve a performance measure at a given \ntask (Mitchell 1997).\nClassical approaches to performing PPC include analyti-\ncal methods and precise simulations, providing solutions that \nmay rapidly become unfeasible in the execution phase due to \nthe stochastic nature of the production system and uncertain-\nties such as machine breakdowns, scrap rate, delayed deliv-\neries, etc. Moreover, Enterprise Resource Planning (ERP) \nsystems perform poorly at the operative level (Gyulai et al. \n2015). To tackle this issue, ML can endow the PPC with \nthe capacity of learning from historical or real-time data to \nreact to predictable and unpredictable events. Even though \nthis may suggest that organizations must invest in data ware-\nhousing to handle the mass amount of collected data, stud-\nies have reported that enterprises successfully implementing \ndata-driven solutions have experienced a payback of 10–70 \ntimes their investment in data warehousing (Rainer 2013).\nHaving introduced the synergism between ML and PPC, \nthis study aims to provide an analysis of its state-of-the-art \nthrough a systematic literature review. This will contribute \nto the definition of a methodology to implement a ML-PPC \nand to the proposal of a map to classify scientific literature. \nThis paper analyzes research produced in the context of the \nI4.0 and is guided by five research questions:\n1.\t Which are the activities employed to perform a ML-\nPPC?\n2.\t Which are the techniques and tools used to implement a \nML-PPC?\n3.\t Which are the currently harnessed data sources to imple-\nment a ML-PPC?\n4.\t Which are the addressed use cases by the recent scien-\ntific literature in ML-PPC?\n5.\t Which are the characteristics of the I4.0 targeted by the \nrecent scientific literature in ML-PPC?\nThe first three questions are related to the first objective \nof this research. They will contribute to the definition of a \nmethodology to implement a ML-PPC. The last two ques-\ntions address the second objective, as they will provide the \nbasis to create a classification map.\nThe reminder of this paper is organized as follows: sec-\ntion “Research methodology and contribution” will explain \nthe systematic literature review methodology employed to \nsearch and choose the sample of scientific articles. Addition-\nally, the contribution of this paper with respect to similar \nstudies will be briefly highlighted and a short bibliometric \nanalysis is presented to assess the keywords used as string \nchains. The “Analytical framework” section will explain the \nfour axes encompassed by the analytical framework. After-\nwards, the “Results” section will focus on the results of the \nsystematic literature review and an analysis of it. Finally, \nthe “Conclusion and further research perspectives” sec-\ntion will conclude this study and provide further research \nperspectives.\nResearch methodology and contribution\nTo meet the two objectives of this study, a systematic litera-\nture review was carried out following the method proposed \nby Tranfield et al. (2003) who extended research methods \nfrom the medical sector to the management sciences. This \nmethod has been successfully employed by other authors to \ndraw insights from the scientific literature (Garengo et al. \n2005; Moeuf et al. 2018). This literature review focuses \nexclusively on applications of ML in PPC in the context \nof I4.0.\nIn another domain, Zhong et al. (2016), proposed a bibli-\nometric analysis of big data applications on different sectors \nsuch as healthcare, supply chain, finance, etc. but its focus on \nmanufacturing was limited. (Kusiak 2017; Tao et al. 2018; \nWang et al. 2018a) provided a literature analysis of data-\ndriven smart manufacturing, citing representative references. \n", []], "Introduction": ["Vol.:(0123456789)\n1 3\nJournal of Intelligent Manufacturing (2020) 31:1531–1558 \nhttps://doi.org/10.1007/s10845-019-01531-7\nMachine learning applied in production planning and control: \na state‑of‑the‑art in the era of industry 4.0\nJuan Pablo Usuga Cadavid1   · Samir Lamouri1 · Bernard Grabot2 · Robert Pellerin3 · Arnaud Fortin4\nReceived: 15 July 2019 / Accepted: 30 December 2019 / Published online: 11 January 2020 \n© Springer Science+Business Media, LLC, part of Springer Nature 2020\nAbstract\nBecause of their cross-functional nature in the company, enhancing Production Planning and Control (PPC) functions can \nlead to a global improvement of manufacturing systems. With the advent of the Industry 4.0 (I4.0), copious availability \nof data, high-computing power and large storage capacity have made of Machine Learning (ML) approaches an appealing \nsolution to tackle manufacturing challenges. As such, this paper presents a state-of-the-art of ML-aided PPC (ML-PPC) \ndone through a systematic literature review analyzing 93 recent research application articles. This study has two main objec-\ntives: contribute to the definition of a methodology to implement ML-PPC and propose a mapping to classify the scientific \nliterature to identify further research perspectives. To achieve the first objective, ML techniques, tools, activities, and data \nsources which are required to implement a ML-PPC are reviewed. The second objective is developed through the analysis of \nthe use cases and the addressed characteristics of the I4.0. Results suggest that 75% of the possible research domains in ML-\nPPC are barely explored or not addressed at all. This lack of research originates from two possible causes: firstly, scientific \nliterature rarely considers customer, environmental, and human-in-the-loop aspects when linking ML to PPC. Secondly, \nrecent applications seldom couple PPC to logistics as well as to design of products and processes. Finally, two key pitfalls \nare identified in the implementation of ML-PPC models: the complexity of using Internet of Things technologies to collect \ndata and the difficulty of updating the ML model to adapt it to the manufacturing system changes.\nKeywords  Machine learning · Industry 4.0 · Smart manufacturing · Production planning and control · State-of-the-art · \nSystematic literature review\nIntroduction\nThe current manufacturing environment is characterized \nby high complexity, dynamic production conditions and \nvolatile markets. Additionally, companies must offer cus-\ntomized products while engaging low costs and reducing \nthe time-to-market if they want to remain competitive in a \nglobalized world (Schuh et al. 2017b; Carvajal Soto et al. \n2019). This situation poses tremendous challenges for \nmanufacturers who seek to implement new technologies \nto meet their objectives while expecting a return on invest-\nment. Several countries have developed projects that aim \nto help companies adapt their industries to new production \ntechnologies. For instance, Germany created Industry 4.0 \n(I4.0), the United States proposed the Smart Manufacturing \nLeadership Coalition, and China introduced the plan called \nChina Manufacturing 2025 (Wang et al. 2018a). This has led \nto significant financial support for manufacturing research; \n *\t Juan Pablo Usuga Cadavid \n\t\njuan_pablo.usuga_cadavid@ensam.eu\n\t\nSamir Lamouri \n\t\nsamir.lamouri@ensam.eu\n\t\nBernard Grabot \n\t\nbernard.grabot@enit.fr\n\t\nRobert Pellerin \n\t\nrobert.pellerin@polymtl.ca\n\t\nArnaud Fortin \n\t\na.fortin@ifakt.com\n1\t\nLAMIH, Arts et Métiers ParisTech, Paris, France\n2\t\nLGP, INP/ENIT, Tarbes, France\n3\t\nMathematics and Industrial Engineering Department, \nPolytechnique de Montreal, Montreal, Canada\n4\t\niFAKT France SAS, Toulouse, France\n", []], "Abstract": ["Vol.:(0123456789)\n1 3\nJournal of Intelligent Manufacturing (2020) 31:1531–1558 \nhttps://doi.org/10.1007/s10845-019-01531-7\nMachine learning applied in production planning and control: \na state‑of‑the‑art in the era of industry 4.0\nJuan Pablo Usuga Cadavid1   · Samir Lamouri1 · Bernard Grabot2 · Robert Pellerin3 · Arnaud Fortin4\nReceived: 15 July 2019 / Accepted: 30 December 2019 / Published online: 11 January 2020 \n© Springer Science+Business Media, LLC, part of Springer Nature 2020\nAbstract\nBecause of their cross-functional nature in the company, enhancing Production Planning and Control (PPC) functions can \nlead to a global improvement of manufacturing systems. With the advent of the Industry 4.0 (I4.0), copious availability \nof data, high-computing power and large storage capacity have made of Machine Learning (ML) approaches an appealing \nsolution to tackle manufacturing challenges. As such, this paper presents a state-of-the-art of ML-aided PPC (ML-PPC) \ndone through a systematic literature review analyzing 93 recent research application articles. This study has two main objec-\ntives: contribute to the definition of a methodology to implement ML-PPC and propose a mapping to classify the scientific \nliterature to identify further research perspectives. To achieve the first objective, ML techniques, tools, activities, and data \nsources which are required to implement a ML-PPC are reviewed. The second objective is developed through the analysis of \nthe use cases and the addressed characteristics of the I4.0. Results suggest that 75% of the possible research domains in ML-\nPPC are barely explored or not addressed at all. This lack of research originates from two possible causes: firstly, scientific \nliterature rarely considers customer, environmental, and human-in-the-loop aspects when linking ML to PPC. Secondly, \nrecent applications seldom couple PPC to logistics as well as to design of products and processes. Finally, two key pitfalls \nare identified in the implementation of ML-PPC models: the complexity of using Internet of Things technologies to collect \ndata and the difficulty of updating the ML model to adapt it to the manufacturing system changes.\nKeywords  Machine learning · Industry 4.0 · Smart manufacturing · Production planning and control · State-of-the-art · \nSystematic literature review\nIntroduction\nThe current manufacturing environment is characterized \nby high complexity, dynamic production conditions and \nvolatile markets. Additionally, companies must offer cus-\ntomized products while engaging low costs and reducing \nthe time-to-market if they want to remain competitive in a \nglobalized world (Schuh et al. 2017b; Carvajal Soto et al. \n2019). This situation poses tremendous challenges for \nmanufacturers who seek to implement new technologies \nto meet their objectives while expecting a return on invest-\nment. Several countries have developed projects that aim \nto help companies adapt their industries to new production \ntechnologies. For instance, Germany created Industry 4.0 \n(I4.0), the United States proposed the Smart Manufacturing \nLeadership Coalition, and China introduced the plan called \nChina Manufacturing 2025 (Wang et al. 2018a). This has led \nto significant financial support for manufacturing research; \n *\t Juan Pablo Usuga Cadavid \n\t\njuan_pablo.usuga_cadavid@ensam.eu\n\t\nSamir Lamouri \n\t\nsamir.lamouri@ensam.eu\n\t\nBernard Grabot \n\t\nbernard.grabot@enit.fr\n\t\nRobert Pellerin \n\t\nrobert.pellerin@polymtl.ca\n\t\nArnaud Fortin \n\t\na.fortin@ifakt.com\n1\t\nLAMIH, Arts et Métiers ParisTech, Paris, France\n2\t\nLGP, INP/ENIT, Tarbes, France\n3\t\nMathematics and Industrial Engineering Department, \nPolytechnique de Montreal, Montreal, Canada\n4\t\niFAKT France SAS, Toulouse, France\n", []], "Machine learning applied in production planning and control: a state-of-the-art in the era of industry 4.0": ["Vol.:(0123456789)\n1 3\nJournal of Intelligent Manufacturing (2020) 31:1531–1558 \nhttps://doi.org/10.1007/s10845-019-01531-7\nMachine learning applied in production planning and control: \na state‑of‑the‑art in the era of industry 4.0\nJuan Pablo Usuga Cadavid1   · Samir Lamouri1 · Bernard Grabot2 · Robert Pellerin3 · Arnaud Fortin4\nReceived: 15 July 2019 / Accepted: 30 December 2019 / Published online: 11 January 2020 \n© Springer Science+Business Media, LLC, part of Springer Nature 2020\nAbstract\nBecause of their cross-functional nature in the company, enhancing Production Planning and Control (PPC) functions can \nlead to a global improvement of manufacturing systems. With the advent of the Industry 4.0 (I4.0), copious availability \nof data, high-computing power and large storage capacity have made of Machine Learning (ML) approaches an appealing \nsolution to tackle manufacturing challenges. As such, this paper presents a state-of-the-art of ML-aided PPC (ML-PPC) \ndone through a systematic literature review analyzing 93 recent research application articles. This study has two main objec-\ntives: contribute to the definition of a methodology to implement ML-PPC and propose a mapping to classify the scientific \nliterature to identify further research perspectives. To achieve the first objective, ML techniques, tools, activities, and data \nsources which are required to implement a ML-PPC are reviewed. The second objective is developed through the analysis of \nthe use cases and the addressed characteristics of the I4.0. Results suggest that 75% of the possible research domains in ML-\nPPC are barely explored or not addressed at all. This lack of research originates from two possible causes: firstly, scientific \nliterature rarely considers customer, environmental, and human-in-the-loop aspects when linking ML to PPC. Secondly, \nrecent applications seldom couple PPC to logistics as well as to design of products and processes. Finally, two key pitfalls \nare identified in the implementation of ML-PPC models: the complexity of using Internet of Things technologies to collect \ndata and the difficulty of updating the ML model to adapt it to the manufacturing system changes.\nKeywords  Machine learning · Industry 4.0 · Smart manufacturing · Production planning and control · State-of-the-art · \nSystematic literature review\nIntroduction\nThe current manufacturing environment is characterized \nby high complexity, dynamic production conditions and \nvolatile markets. Additionally, companies must offer cus-\ntomized products while engaging low costs and reducing \nthe time-to-market if they want to remain competitive in a \nglobalized world (Schuh et al. 2017b; Carvajal Soto et al. \n2019). This situation poses tremendous challenges for \nmanufacturers who seek to implement new technologies \nto meet their objectives while expecting a return on invest-\nment. Several countries have developed projects that aim \nto help companies adapt their industries to new production \ntechnologies. For instance, Germany created Industry 4.0 \n(I4.0), the United States proposed the Smart Manufacturing \nLeadership Coalition, and China introduced the plan called \nChina Manufacturing 2025 (Wang et al. 2018a). This has led \nto significant financial support for manufacturing research; \n *\t Juan Pablo Usuga Cadavid \n\t\njuan_pablo.usuga_cadavid@ensam.eu\n\t\nSamir Lamouri \n\t\nsamir.lamouri@ensam.eu\n\t\nBernard Grabot \n\t\nbernard.grabot@enit.fr\n\t\nRobert Pellerin \n\t\nrobert.pellerin@polymtl.ca\n\t\nArnaud Fortin \n\t\na.fortin@ifakt.com\n1\t\nLAMIH, Arts et Métiers ParisTech, Paris, France\n2\t\nLGP, INP/ENIT, Tarbes, France\n3\t\nMathematics and Industrial Engineering Department, \nPolytechnique de Montreal, Montreal, Canada\n4\t\niFAKT France SAS, Toulouse, France\n", []]}